#+TITLE: Statistic Computing
#+PROPERTY: header-args:R :results output

*** Interactive command
We need to know what's going on in the current workspace.  =getwd()=
and =setwd()= get and set the current dir.  =ls()= list the objects
currently stored.  =rm(x, y, z)= remove objects =rm(list=ls())= remove
all objects. =objects()= create and store current objects.

We can perform some IO by =save.image("mydata.Rdata")= and
=load("mydata.Rdata")= will save and load workspace in current
directory respectively.  =source("a.R")= loads a script.
=sink("a.lis")= redirects the output to a file, and =sink()= restore
that to standard output.

You can view documentation by calling help =help(lm)=. =?lm= and
=??solve= also shows documentation, while =example(topic)=, as its
name indicates, shows the examples.  =help.start()= opens the html
documentation page.

Finally, =q()= quit R.

The =print= function can output the value of a variable.

#+BEGIN_SRC R
print("hello")
cat("world", "!", "\n")
print(c(1,2,3))
#+END_SRC

#+RESULTS:
: [1] "hello"
: world !
: [1] 1 2 3



To enter the debugger, a call to =browser= function suffices.  This allows you
to browse the values at that point.  A more powerful debugger is by a call to
=debug= with the function name as argument.  Each time that function is called,
you enter the debug and can control the execution.  Tracing can be registered by
=trace= or =untrace= with the name of the function.  It might need to be quoted
in some case, so you'd better quote it, with double quotes.  Every time the
function is invoked, the return value will be printed as trace.

** Scope

The scope is pretty weired, it is lexical scoping, but assign to the variable
has no effect. You have to use =<<-= to assign.


#+BEGIN_SRC R
f <- function() {
  var <- 0
  list(
    print = function() {
      print(var)
    },
    add1 = function() {
      var <- var + 1
    },
    sub1 = function() {
      var <<- var - 1
    })}
l <- f()
l$print()
l$add1()
l$print()
l$sub1()
l$print()
#+END_SRC

#+RESULTS:
: [1] 0
: [1] 0
: [1] -1

The function parameter is always local, changing it have no effect outside:

#+BEGIN_SRC R
f <- function (var) {
  var[1] <- 8
}
x <- c(1,2,3)
f(x)
x
#+END_SRC

#+RESULTS:
: [1] 1 2 3

It is call by value, for all objects. You can NOT even change a global variable,
even using =<<-=:

#+BEGIN_SRC R
x <- 1
f <- function() {
  x <<- 2
}
x
#+END_SRC

#+RESULTS:
: [1] 1




*** primitives

Looks like all numbers are double by default:

#+BEGIN_SRC R
typeof(1)
typeof(1L)
#+END_SRC

#+RESULTS:
: [1] "double"
: [1] "integer"

*** Vector
Create a vector by =c()=, which is append:

#+BEGIN_SRC R
c(1,2,3)
x <- c(1,2,3)
c(x, 0, x)
#+END_SRC

#+RESULTS:
: [1] 1 2 3
: [1] 1 2 3 0 1 2 3

Vectors are the array of objects of the same mode (type).

#+BEGIN_SRC R
c(1, "hello")
#+END_SRC

#+RESULTS:
: [1] "1"     "hello"



To create a sequence:
#+BEGIN_SRC R
1:10
10:1
#+END_SRC

#+RESULTS:
:  [1]  1  2  3  4  5  6  7  8  9 10
:  [1] 10  9  8  7  6  5  4  3  2  1


Colon operator has higher priority:

#+BEGIN_SRC R :results output
2*1:10
#+END_SRC

#+RESULTS:
:  [1]  2  4  6  8 10 12 14 16 18 20

The more powerful sequence function is =seq=:

#+BEGIN_SRC R :results output
seq(1,10)
seq(-1, 1, by=.2)
seq(length=10, from=-5, by=.2)
#+END_SRC

#+RESULTS:
:  [1]  1  2  3  4  5  6  7  8  9 10
:  [1] -1.0 -0.8 -0.6 -0.4 -0.2  0.0  0.2  0.4  0.6  0.8  1.0
:  [1] -5.0 -4.8 -4.6 -4.4 -4.2 -4.0 -3.8 -3.6 -3.4 -3.2

Repeating something:

#+BEGIN_SRC R
x <- c(1,2,3)
rep(x, times=3)
rep(x, each=3)
#+END_SRC

#+RESULTS:
: [1] 1 2 3 1 2 3 1 2 3
: [1] 1 1 1 2 2 2 3 3 3


The length, mode, typeof
#+BEGIN_SRC R
x <- c(1,2,3)
length(x)
mode(x)
typeof(x)
#+END_SRC

#+RESULTS:
: [1] 3
: [1] "numeric"
: [1] "double"


*** Indexing

Vectors can be indexed by integers, starting from 1.

#+BEGIN_SRC R
x <- c(1,2,3,4)
x[2]
#+END_SRC

#+RESULTS:
: [1] 2

It can also be indexed by vector of integers

#+BEGIN_SRC R
x <- c(1,2,3,4)
x[c(1,3)]
#+END_SRC

#+RESULTS:
: [1] 1 3

Negative index selects the elements other than those index. The index 0 will
return empty (HEBI: ??).

#+BEGIN_SRC R
x <- c(1,2,3,4)
x[0]
x[-1]
x[c(-1, -3)]
#+END_SRC

#+RESULTS:
: numeric(0)
: [1] 2 3 4
: [1] 2 4

Indexing by logical vector

#+BEGIN_SRC R
x <- c(1,2,3,4)
x[c(TRUE, FALSE, TRUE, FALSE)]
#+END_SRC

#+RESULTS:
: [1] 1 3

Or by its name, where the string is compared *partially* (HEBI: ??)

#+BEGIN_SRC R
x <- c(1,2,3)
names(x) <- c("hello", "world", "lala")
x
x["hel"]
x["hello"]
x[c("hello", "world")]
#+END_SRC

#+RESULTS:
: hello world  lala
:     1     2     3
: <NA>
:   NA
: hello
:     1
: hello world
:     1     2

*** cbind & rbind
This is to *combine* (for matrix, similar to append for vector) arguments in
row-wise or column-wise, and creates matrix. This will apply broadcast.

#+BEGIN_SRC R
cbind(0, rbind(1, 1:3))
#+END_SRC

#+RESULTS:
:      [,1] [,2] [,3] [,4]
: [1,]    0    1    1    1
: [2,]    0    1    2    3



*** matrix

Matrix can be created by the =matrix= function.

#+BEGIN_SRC R
x <- matrix(1:8, nrow=2)
x
dim(x)
#+END_SRC

#+RESULTS:
:      [,1] [,2] [,3] [,4]
: [1,]    1    3    5    7
: [2,]    2    4    6    8
: [1] 2 4

Specify dimnames:

#+BEGIN_SRC R
matrix(1:6, nrow = 2, dimnames = list(c("a", "b"), LETTERS[1:3]))
#+END_SRC

#+RESULTS:
:   A B C
: a 1 3 5
: b 2 4 6

When indexing, the drop argument (defaulting to TRUE), if TRUE, the result is
coerced to the lowest possible dimension:

#+BEGIN_SRC R
m <- matrix(1:6, nrow = 2, dimnames = list(c("a", "b"), LETTERS[1:3]))
m[1,]
m[1, , drop = FALSE]
#+END_SRC

#+RESULTS:
: A B C
: 1 3 5
:   A B C
: a 1 3 5



*** list
list is a misnomer, it is a dict

#+BEGIN_SRC R
l <- list(hello=1, "world"=2)
l
l$hello
l$world
#+END_SRC

#+RESULTS:
: $hello
: [1] 1
:
: $world
: [1] 2
:
: [1] 1
: [1] 2


When indexing lists, =[]= retains names, while =[[]]= returns only the element:

#+BEGIN_SRC R
c(abc = 123)[1]
#+END_SRC

#+RESULTS:
: abc
: 123


#+BEGIN_SRC R
c(abc = 123)[[1]]
#+END_SRC

#+RESULTS:
: [1] 123



*** Conditional
- if: =if (STMT) STMT else if (STMT) STMT else STMT=

The switch is quite interesting. It is

#+BEGIN_SRC R
switch(x, list...)
#+END_SRC

The semantic is to find x in the list and return the value. If x is not in list,
return NULL.

An unnamed list has implicit index as name:

#+BEGIN_SRC R
switch(2,1,2,3)
#+END_SRC

#+RESULTS:
: [1] 2

Using name:

#+BEGIN_SRC R
switch("hello", hello=1, world=2)
#+END_SRC

#+RESULTS:
: [1] 1

not found, return NULL:

#+BEGIN_SRC R
is.null(switch("nothing", hello=1))
#+END_SRC

#+RESULTS:
: [1] TRUE

Interestingly, even for named list, we can still use the index:

#+BEGIN_SRC R
switch(2, hello=1, world=2)
#+END_SRC

#+RESULTS:
: [1] 2


*** Loop
- for loop: =for (NAME in VECTOR) STMT=
- while loop: =while (STMT) STMT=
- repeat: =repeat STMT=
- =break=, =next=


#+BEGIN_SRC R
ret <- c()
for (i in 1:5) {
  ret <- c(ret, i)
}
ret
#+END_SRC

#+RESULTS:
: [1] 1 2 3 4 5


** Function
=function (ARGLIST) BODY=

The argument list can be a symbol, a ~symbol=value~, or a =...=.
The body is a compound expression, surrounded with ={}=.
Function can be assigned to a symbol.

The matching of formals and actual are pretty tricky.
1. exact matching on tags
2. partial matching on tags
3. positional matching for =...= Partial matching result must be unique, but the
   exact matched ones are excluded before this step is entered.

#+BEGIN_SRC R
f <- function(a, b, c) {
  return(c(a, b+c))
}
f(1,2,3)
#+END_SRC

#+RESULTS:
: [1] 1 5


*** Linear model

A linear model is created *and fitted* by =lm()= function, with the model
formula and data frame. For example:

#+BEGIN_SRC R
df = data.frame(x=c(1,2,3), y=c(2,4,6))
fm = lm(y ~ x, data=df)
summary(fm)
#+END_SRC

#+RESULTS:
#+begin_example

Call:
lm(formula = y ~ x, data = df)

Residuals:
1 2 3
0 0 0

Coefficients:
            Estimate Std. Error t value Pr(>|t|)
(Intercept)        0          0      NA       NA
x                  2          0     Inf   <2e-16 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0 on 1 degrees of freedom
Multiple R-squared:      1,	Adjusted R-squared:      1
F-statistic:   Inf on 1 and 1 DF,  p-value: < 2.2e-16

#+end_example

The fitted model in the variable =fm= can be accessed by:
- =coef=: extract the coefficients
- =deviance=: the Residual Sum of Square
- =formula=: extract the model formula
- =plot=: produce four plots: residuals, fitted values, diagnostics.
- =predict(OBJECT, newdata=DATA.FRAME)=: use the model to predict
- =residuals=: extract the residuals
- =summary()=

The models can be updated, if the formula only changes a little bit.  In the
following example, the =.= means the corresponding part of the original formula.

#+BEGIN_SRC R
fs <- lm(y ~ x1 + x2, data=mydf)
fs <- update(fs, . ~ . + x3)
fs <- update(fs, sqrt(.) ~ .)
#+END_SRC

